english/vocabulary.org
#+OPTIONS: toc:1 ^:nil ~:nil num:nil reveal_title_slide:nil timestamp:nil
#+TAGS: AWL(a)

Record my english study process.
1. C represent less 1000 occur on youtube

* return
:PROPERTIES:
:EXPORT_FILE_NAME: return.md
:END:
返回了
** 语义
*** 返回
It was forty five minutes before she returned.
*** 归还
Carson returned the notebook to his pocket.
*** 重新出现
If the pain returns, take two of the tablets with some water.
*** 回报
He smiled at her warmly and she returned his smile.
*** 回答
'Yes,' he returned.'I'm a lucky man.'
*** 选举
Yeo was returned to Parliament with an increased majority.
*** 产生利润
The group returned increased profits last year.
*** 回来
We're all looking forward to your return!
*** 送还
A mother is appealing for the safe return of her baby son.
*** 恢复
The United States called for a return to democracy.
*** 重新开始
Rose's return to the teaching profession.
*** 盈利
The markets are showing extremely poor returns.
*** 回车键
Key in the file name and press return.
*** 再度出现
She felt a return of her old anxiety.
*** 申报
An analysis of 1851 census returns.
*** 投票结果
What are the returns from last night's voting?
*** 往返的
He bought a return ticket and boarded the next train for home.
** 短语
*** return to
**** 回复原状
David waited for a moment to let his breathing return to normal.

https://youglish.com/getbyid/89091396/return%20to%20normal/english
**** 继续
The children return to school next week.
**** 再讨论
I will return to this problem in a moment.
*** in return
He is always helping people without expecting anything in return.

https://youglish.com/getbyid/114943043/in%20return/english
